using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Map2 : MapData
{
    private void Awake()
    {
        maps = new int[9,13]{//数据化地图，高台为1，怪可走为2，终点为0
        {1,1,1,1,1,1,1,1,1,1,1,1,1},//0
        {1,2,1,2,1,1,1,1,1,2,1,2,1},
        {1,2,1,2,1,1,1,1,1,2,1,2,1},//2
        {1,2,1,2,1,1,1,1,1,2,1,2,1},
        {1,2,1,2,1,1,1,1,1,2,1,2,1},//4
        {1,2,1,2,2,2,2,2,2,2,1,2,1},
        {1,2,2,1,1,2,1,2,1,1,2,2,1},
        {1,1,2,2,2,2,2,2,2,2,2,1,1},//7
        {1,1,1,1,1,2,0,2,1,1,1,1,1}
        };//数据化地图，高台为1，怪可走为2，终点为0
    }
}
